# Start

In [1]:
# Librerías

import numpy as np
import pandas as pd
import sys

# Funciones del archivo fun.py

sys.path.append('/home/marta/Desktop/IH/Lets_blockbust/SCC')
from fun import firstglance

In [2]:
# Importamos los datos de todas las tablas disponibles

actor = pd.read_csv('../data/actor.csv')
category = pd.read_csv('../data/category.csv')
film = pd.read_csv('../data/film.csv')
language = pd.read_csv('../data/language.csv') 
actorfilm = pd.read_csv('../data/old_HDD.csv') # Esta conectará actores y películas, le cambiamos el nombre
rental = pd.read_csv('../data/rental.csv') 
inventory = pd.read_csv('../data/inventory.csv')

# Análisis preliminar y limpieza básica

Vamos a echar un ojo a cada tabla, con sus nulos, la información general y su tamaño. 
Para ello diseñamos una función llamada firstglance(x) 
que guardaremos en fun.py dentro de SCC y usaremos a partir de ahora.

# Tabla actor

In [3]:
firstglance(actor)

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

Shape: (200, 4)

Null values count:

actor_id       0
first_name     0
last_name      0
last_update    0
dtype: int64

Table info:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

None

In [4]:
# Es una tabla sin nulos, con la información aparentemente bien organizada según el head.
# Vamos columna a columna a ver si los datos son homogéneos.

actor.actor_id # El id está bien, hay 200 datos y están bien etiquetados.

0        1
1        2
2        3
3        4
4        5
      ...
195    196
196    197
197    198
198    199
199    200
Name: actor_id, Length: 200, dtype: int64

In [5]:
actor.first_name.value_counts() # Todo bien parece. Hay varios actores y actrices con el mismo nombre

PENELOPE    4
JULIA       4
KENNETH     4
GENE        3
GROUCHO     3
           ..
HENRY       1
DUSTIN      1
JUDE        1
CARMEN      1
THORA       1
Name: first_name, Length: 128, dtype: int64

In [6]:
actor.last_name.value_counts() # Lo mismo.

KILMER     5
TEMPLE     4
NOLTE      4
GUINESS    3
ALLEN      3
          ..
JOLIE      1
DAMON      1
CRUZ       1
SINATRA    1
WALKEN     1
Name: last_name, Length: 121, dtype: int64

In [7]:
# Podría ser interesante unir estas dos últimas columnas. Hagámoslo.

actor['name'] = actor.apply(lambda x:'%s_%s' % (x['first_name'],x['last_name']), axis = 1)

# Ahora nos deshacemos de las dos antiguas:

actor.drop(columns = ['first_name','last_name'], inplace = True)

actor.head()

   actor_id          last_update                 name
0         1  2006-02-15 04:34:33     PENELOPE_GUINESS
1         2  2006-02-15 04:34:33        NICK_WAHLBERG
2         3  2006-02-15 04:34:33             ED_CHASE
3         4  2006-02-15 04:34:33       JENNIFER_DAVIS
4         5  2006-02-15 04:34:33  JOHNNY_LOLLOBRIGIDA

In [8]:
actor.name.value_counts()

SUSAN_DAVIS             2
EWAN_GOODING            1
DARYL_CRAWFORD          1
GRETA_KEITEL            1
JANE_JACKMAN            1
                       ..
MICHELLE_MCCONAUGHEY    1
ADAM_GRANT              1
SEAN_WILLIAMS           1
GARY_PENN               1
THORA_TEMPLE            1
Name: name, Length: 199, dtype: int64

In [9]:
# Fíjate, hay dos Susan Davis con ids distintos! Habrá que añadir un tercer apellido quizá. 
# Como no podemos buscarla en internet (no son actores reales), eliminamos una Susan y reseteamos 
# el índice y el actor_id:

actor.drop_duplicates(subset = 'name', keep = 'first', inplace = True, ignore_index = True)
actor.reset_index(inplace = True, drop = True)
actor.actor_id = [i for i in range(1,actor.shape[0]+1)]
actor.name.value_counts()  # Hecho

PENELOPE_GUINESS        1
KEVIN_GARLAND           1
DARYL_CRAWFORD          1
GRETA_KEITEL            1
JANE_JACKMAN            1
                       ..
MICHELLE_MCCONAUGHEY    1
ADAM_GRANT              1
SEAN_WILLIAMS           1
GARY_PENN               1
THORA_TEMPLE            1
Name: name, Length: 199, dtype: int64

In [10]:
actor.head()

   actor_id          last_update                 name
0         1  2006-02-15 04:34:33     PENELOPE_GUINESS
1         2  2006-02-15 04:34:33        NICK_WAHLBERG
2         3  2006-02-15 04:34:33             ED_CHASE
3         4  2006-02-15 04:34:33       JENNIFER_DAVIS
4         5  2006-02-15 04:34:33  JOHNNY_LOLLOBRIGIDA

In [11]:
# Vamos a por la columna last_update:

actor.last_update.value_counts()

2006-02-15 04:34:33    199
Name: last_update, dtype: int64

In [12]:
# Qué interesante... TODAS las entradas de last_update en la tabla de actores valen lo mismo. 
# Esta columna sobra, es mucho espacio para una misma información.

# Igual tendría sentido crear una tabla nueva con el update de cada una de las demás, 
# si pasa lo mismo en todas con distintas fechas. Metámosla en un nuevo dataframe 
# y quitemos la columna de aquí que estorba:

a = actor.last_update[0]

updates = pd.DataFrame(data = {'table': ['actor'],'last_update':[a]})
actor.drop(columns = 'last_update', inplace = True)

actor.head()

   actor_id                 name
0         1     PENELOPE_GUINESS
1         2        NICK_WAHLBERG
2         3             ED_CHASE
3         4       JENNIFER_DAVIS
4         5  JOHNNY_LOLLOBRIGIDA

# Tabla film

In [13]:
firstglance(film)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

Shape: (1000, 13)

Null values count:

film_id                    0
title                      0
description                0
release_year               0
language_id                0
original_language_id    1000
rental_duration            0
rental_rate                0
length                     0
replacement_cost           0
rating                     0
special_features           0
last_update                0
dtype: int64

Table info:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 101.7+ KB

None

Vemos que hay una columna que es toda de nulos, el original_language_id. No la vamos a borrar de momento, porque a lo mejor podemos relacionarla como foreign key con alguna de las columnas de la tabla 'language' que hay por ahí. Por ahora le asignamos el proxy 7 para saber que es un campo desconocido (añadiremos idioma 'Unknown' a la tabla de language luego, y le asignaremos id 7).

In [14]:
film.original_language_id = 7

In [15]:
# Vamos a comprobar si pasa lo mismo en last_update que en la tabla anterior, 
# y si ocurre procederemos de la misma manera.

film.last_update.value_counts()

2006-02-15 05:03:42    1000
Name: last_update, dtype: int64

In [16]:
# Es el mismo valor para toda la tabla (que no el mismo que en la columna actor). 
# Lo guardamos en el dataframe de updates y borramos la columna:

a = film.last_update[0]
updates = pd.concat([updates, pd.DataFrame({'table': 'film','last_update':[a]})], axis = 0)

film.drop(columns = 'last_update', inplace = True)

film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,7,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,7,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,7,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,7,6,2.99,130,22.99,G,Deleted Scenes

In [17]:
# Chequeemos el resto de columnas:

film.film_id.value_counts() # todo correcto

1       1
672     1
659     1
660     1
661     1
       ..
339     1
340     1
341     1
342     1
1000    1
Name: film_id, Length: 1000, dtype: int64

In [18]:
film.title.value_counts() # también

ACADEMY DINOSAUR    1
PERFECT GROOVE      1
PARK CITIZEN        1
PARTY KNOCK         1
PAST SUICIDES       1
                   ..
FROGMEN BREAKING    1
FRONTIER CABIN      1
FROST HEAD          1
FUGITIVE MAGUIRE    1
ZORRO ARK           1
Name: title, Length: 1000, dtype: int64

In [19]:
film.description.value_counts() # también

A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies                   1
A Thrilling Yarn of a Dog And a Dog who must Build a Husband in A Baloon                                           1
A Taut Epistle of a Sumo Wrestler And a Girl who must Face a Husband in Ancient Japan                              1
A Fateful Display of a Technical Writer And a Butler who must Battle a Sumo Wrestler in An Abandoned Mine Shaft    1
A Intrepid Tale of a Madman And a Astronaut who must Challenge a Hunter in A Monastery                             1
                                                                                                                  ..
A Unbelieveable Yarn of a Mad Scientist And a Cat who must Chase a Lumberjack in Australia                         1
A Emotional Story of a Madman And a Waitress who must Battle a Teacher in An Abandoned Fun House                   1
A Amazing Reflection of a Lumberjack And a Cat who must Discover a Husband in A MySQL Convention                   1
A Taut Epistle of a Feminist And a Sumo Wrestler who must Battle a Crocodile in Australia                          1
A Intrepid Panorama of a Mad Scientist And a Boy who must Redeem a Boy in A Monastery                              1
Name: description, Length: 1000, dtype: int64

In [20]:
film.release_year.value_counts() # Uy.... ¿TODAS las películas del 2006? Qué raro. Esto igual está mal.

2006    1000
Name: release_year, dtype: int64

Bueno. Después de una búsqueda general de algunas películas en internet, he concluido que quizá no sean películas reales. De momento no hay manera de comprobar si son todas del 2006 o no, pero es información importante para un videoclub así que la dejamos estar.

In [21]:
film.language_id.value_counts() # Todas tienen el mismo language id. 
# Esto no es disparatado y podrían entrar más de otros idiomas si el videoclip crece. La dejamos.

1    1000
Name: language_id, dtype: int64

In [22]:
film.rental_duration.value_counts() # Todo normal, duración en días del préstamo (estipulada? media?)

6    212
3    203
4    203
7    191
5    191
Name: rental_duration, dtype: int64

In [23]:
film.rental_rate.value_counts() # Todo normal, aunque no sé muy bien qué es este valor

0.99    341
4.99    336
2.99    323
Name: rental_rate, dtype: int64

In [24]:
film.length.unique() # Todo normal, duración en minutos en formato entero

array([ 86,  48,  50, 117, 130, 169,  62,  54, 114,  63, 126, 136, 150,
        94,  46, 180,  82,  57, 113,  79, 129,  85,  92, 181,  74, 179,
        91, 168, 119, 153, 147, 127, 121,  68,  99, 148, 137, 170,  83,
       108, 118, 162, 182,  75, 173,  87,  65,  90, 122, 160,  89, 175,
       106,  73, 151, 100,  53,  77, 142,  93, 163, 103,  61,  71, 102,
        76,  98,  72, 176, 123,  56, 161,  60, 133, 125,  67,  52, 120,
       167,  70, 135, 112, 183, 110, 152,  51, 146,  66, 185, 124, 107,
       101, 132, 143, 165,  81, 164,  58,  95, 139,  55, 149, 109,  59,
       172, 115, 184, 166,  64, 104,  69,  84, 144,  88, 141,  47,  49,
       177, 154, 159, 178,  96, 116, 171, 140, 155, 158, 174, 138,  97,
       131, 156,  80, 145, 111, 128, 157,  78, 105, 134])

In [25]:
film.replacement_cost.unique() # Todo bien, coste de reemplazo en formato float

array([20.99, 12.99, 18.99, 26.99, 22.99, 17.99, 28.99, 15.99, 21.99,
       24.99, 16.99, 23.99, 10.99, 14.99, 27.99,  9.99, 19.99, 11.99,
       29.99, 25.99, 13.99])

In [26]:
film.rating.unique() # Todo bien, es el Motion Picture Association film rating system

array(['PG', 'G', 'NC-17', 'PG-13', 'R'], dtype=object)

In [27]:
film.special_features.unique() # Interesante. Esta columna igual interesa dividira en más cachos

array(['Deleted Scenes,Behind the Scenes', 'Trailers,Deleted Scenes',
       'Commentaries,Behind the Scenes', 'Deleted Scenes', 'Trailers',
       'Commentaries,Deleted Scenes',
       'Trailers,Deleted Scenes,Behind the Scenes',
       'Trailers,Commentaries,Behind the Scenes', 'Trailers,Commentaries',
       'Trailers,Behind the Scenes',
       'Commentaries,Deleted Scenes,Behind the Scenes',
       'Trailers,Commentaries,Deleted Scenes',
       'Trailers,Commentaries,Deleted Scenes,Behind the Scenes',
       'Behind the Scenes', 'Commentaries'], dtype=object)

In [28]:
# Vamos a ello.

film['deleted_scenes'] = [1 if 'deleted' in i.lower() else 0 for i in film.special_features]
film['behind_scenes'] = [1 if 'behind' in i.lower() else 0 for i in film.special_features]
film['trailer'] = [1 if 'trailer' in i.lower() else 0 for i in film.special_features]
film['commentaries'] = [1 if 'commentaries' in i.lower() else 0 for i in film.special_features]

# Eliminamos la otra columna: 

film.drop(columns = 'special_features', inplace = True)

film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,deleted_scenes,behind_scenes,trailer,commentaries
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,7,6,0.99,86,20.99,PG,1,1,0,0
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,7,3,4.99,48,12.99,G,1,0,1,0
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,7,2.99,50,18.99,NC-17,1,0,1,0
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,7,5,2.99,117,26.99,G,0,1,0,1
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,7,6,2.99,130,22.99,G,1,0,0,0

In [29]:
# Tabla limpia. A por la conexión entre actores y películas.

# Tabla actorfilm

In [30]:
firstglance(actorfilm)

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

Shape: (1000, 5)

Null values count:

first_name      0
last_name       0
title           0
release_year    0
category_id     0
dtype: int64

Table info:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

None

In [31]:
# Tiene 1000 filas, igual que el número de películas, por lo que estará agrupada en torno a esta categoría. 
# Unimos nombres y apellidos como hicimos antes:

actorfilm['name'] = actorfilm.apply(lambda x:'%s_%s' % (x['first_name'],x['last_name']), axis = 1)

# Nos deshacemos de las dos antiguas:

actorfilm.drop(columns = ['first_name','last_name'], inplace = True)

actorfilm.head()

                   title  release_year  category_id              name
0       ACADEMY DINOSAUR          2006            6  PENELOPE_GUINESS
1   ANACONDA CONFESSIONS          2006            2  PENELOPE_GUINESS
2            ANGELS LIFE          2006           13  PENELOPE_GUINESS
3  BULWORTH COMMANDMENTS          2006           10  PENELOPE_GUINESS
4          CHEAPER CLYDE          2006           14  PENELOPE_GUINESS

In [32]:
# Como esta será la tabla de conexión entre autores y películas, vamos a cambiar el nombre y el título 
# por el id correspondiente en cada caso que será más eficiente.
# Creamos diccionarios para emparejar cada película con su film_id, y cada actor con su actor_id:

film_dict = dict(zip(film.title.values, film.film_id.values))
actor_dict = dict(zip(actor.name.values, actor.actor_id.values))

film_dict

{'ACADEMY DINOSAUR': 1,
 'ACE GOLDFINGER': 2,
 'ADAPTATION HOLES': 3,
 'AFFAIR PREJUDICE': 4,
 'AFRICAN EGG': 5,
 'AGENT TRUMAN': 6,
 'AIRPLANE SIERRA': 7,
 'AIRPORT POLLOCK': 8,
 'ALABAMA DEVIL': 9,
 'ALADDIN CALENDAR': 10,
 'ALAMO VIDEOTAPE': 11,
 'ALASKA PHANTOM': 12,
 'ALI FOREVER': 13,
 'ALICE FANTASIA': 14,
 'ALIEN CENTER': 15,
 'ALLEY EVOLUTION': 16,
 'ALONE TRIP': 17,
 'ALTER VICTORY': 18,
 'AMADEUS HOLY': 19,
 'AMELIE HELLFIGHTERS': 20,
 'AMERICAN CIRCUS': 21,
 'AMISTAD MIDSUMMER': 22,
 'ANACONDA CONFESSIONS': 23,
 'ANALYZE HOOSIERS': 24,
 'ANGELS LIFE': 25,
 'ANNIE IDENTITY': 26,
 'ANONYMOUS HUMAN': 27,
 'ANTHEM LUKE': 28,
 'ANTITRUST TOMATOES': 29,
 'ANYTHING SAVANNAH': 30,
 'APACHE DIVINE': 31,
 'APOCALYPSE FLAMINGOS': 32,
 'APOLLO TEEN': 33,
 'ARABIA DOGMA': 34,
 'ARACHNOPHOBIA ROLLERCOASTER': 35,
 'ARGONAUTS TOWN': 36,
 'ARIZONA BANG': 37,
 'ARK RIDGEMONT': 38,
 'ARMAGEDDON LOST': 39,
 'ARMY FLINTSTONES': 40,
 'ARSENIC INDEPENDENCE': 41,
 'ARTIST COLDBLOODED': 42,
 'ATLANTIS CAUSE': 43,
 'ATTACKS HATE': 44,
 'ATTRACTION NEWTON': 45,
 'AUTUMN CROW': 46,
 'BABY HALL': 47,
 'BACKLASH UNDEFEATED': 48,
 'BADMAN DAWN': 49,
 'BAKED CLEOPATRA': 50,
 'BALLOON HOMEWARD': 51,
 'BALLROOM MOCKINGBIRD': 52,
 'BANG KWAI': 53,
 'BANGER PINOCCHIO': 54,
 'BARBARELLA STREETCAR': 55,
 'BAREFOOT MANCHURIAN': 56,
 'BASIC EASY': 57,
 'BEACH HEARTBREAKERS': 58,
 'BEAR GRACELAND': 59,
 'BEAST HUNCHBACK': 60,
 'BEAUTY GREASE': 61,
 'BED HIGHBALL': 62,
 'BEDAZZLED MARRIED': 63,
 'BEETHOVEN EXORCIST': 64,
 'BEHAVIOR RUNAWAY': 65,
 'BENEATH RUSH': 66,
 'BERETS AGENT': 67,
 'BETRAYED REAR': 68,
 'BEVERLY OUTLAW': 69,
 'BIKINI BORROWERS': 70,
 'BILKO ANONYMOUS': 71,
 'BILL OTHERS': 72,
 'BINGO TALENTED': 73,
 'BIRCH ANTITRUST': 74,
 'BIRD INDEPENDENCE': 75,
 'BIRDCAGE CASPER': 76,
 'BIRDS PERDITION': 77,
 'BLACKOUT PRIVATE': 78,
 'BLADE POLISH': 79,
 'BLANKET BEVERLY': 80,
 'BLINDNESS GUN': 81,
 'BLOOD ARGONAUTS': 82,
 'BLUES INSTINCT': 83,
 'BOILED DARES': 84,
 'BONNIE HOLOCAUST': 85,
 'BOOGIE AMELIE': 86,
 'BOONDOCK BALLROOM': 87,
 'BORN SPINAL': 88,
 'BORROWERS BEDAZZLED': 89,
 'BOULEVARD MOB': 90,
 'BOUND CHEAPER': 91,
 'BOWFINGER GABLES': 92,
 'BRANNIGAN SUNRISE': 93,
 'BRAVEHEART HUMAN': 94,
 'BREAKFAST GOLDFINGER': 95,
 'BREAKING HOME': 96,
 'BRIDE INTRIGUE': 97,
 'BRIGHT ENCOUNTERS': 98,
 'BRINGING HYSTERICAL': 99,
 'BROOKLYN DESERT': 100,
 'BROTHERHOOD BLANKET': 101,
 'BUBBLE GROSSE': 102,
 'BUCKET BROTHERHOOD': 103,
 'BUGSY SONG': 104,
 'BULL SHAWSHANK': 105,
 'BULWORTH COMMANDMENTS': 106,
 'BUNCH MINDS': 107,
 'BUTCH PANTHER': 108,
 'BUTTERFLY CHOCOLAT': 109,
 'CABIN FLASH': 110,
 'CADDYSHACK JEDI': 111,
 'CALENDAR GUNFIGHT': 112,
 'CALIFORNIA BIRDS': 113,
 'CAMELOT VACATION': 114,
 'CAMPUS REMEMBER': 115,
 'CANDIDATE PERDITION': 116,
 'CANDLES GRAPES': 117,
 'CANYON STOCK': 118,
 'CAPER MOTIONS': 119,
 'CARIBBEAN LIBERTY': 120,
 'CAROL TEXAS': 121,
 'CARRIE BUNCH': 122,
 'CASABLANCA SUPER': 123,
 'CASPER DRAGONFLY': 124,
 'CASSIDY WYOMING': 125,
 'CASUALTIES ENCINO': 126,
 'CAT CONEHEADS': 127,
 'CATCH AMISTAD': 128,
 'CAUSE DATE': 129,
 'CELEBRITY HORN': 130,
 'CENTER DINOSAUR': 131,
 'CHAINSAW UPTOWN': 132,
 'CHAMBER ITALIAN': 133,
 'CHAMPION FLATLINERS': 134,
 'CHANCE RESURRECTION': 135,
 'CHAPLIN LICENSE': 136,
 'CHARADE DUFFEL': 137,
 'CHARIOTS CONSPIRACY': 138,
 'CHASING FIGHT': 139,
 'CHEAPER CLYDE': 140,
 'CHICAGO NORTH': 141,
 'CHICKEN HELLFIGHTERS': 142,
 'CHILL LUCK': 143,
 'CHINATOWN GLADIATOR': 144,
 'CHISUM BEHAVIOR': 145,
 'CHITTY LOCK': 146,
 'CHOCOLAT HARRY': 147,
 'CHOCOLATE DUCK': 148,
 'CHRISTMAS MOONSHINE': 149,
 'CIDER DESIRE': 150,
 'CINCINATTI WHISPERER': 151,
 'CIRCUS YOUTH': 152,
 'CITIZEN SHREK': 153,
 'CLASH FREDDY': 154,
 'CLEOPATRA DEVIL': 155,
 'CLERKS ANGELS': 156,
 'CLOCKWORK PARADISE': 157,
 'CLONES PINOCCHIO': 158,
 'CLOSER BANG': 159,
 'CLUB GRAFFITI': 160,
 'CLUE GRAIL': 161,
 'CLUELESS BUCKET': 162,
 'CLYDE THEORY': 163,
 'COAST RAINBOW': 164,
 'COLDBLOODED DARLING': 165,
 'COLOR PHILADELPHIA': 166,
 'COMA HEAD': 167,
 'COMANCHEROS ENEMY': 168,
 'COMFORTS RUSH': 169,
 'COMMAND DARLING': 170,
 'COMMANDMENTS EXPRESS': 171,
 'CONEHEADS SMOOCHY': 172,
 'CONFESSIONS MAGUIRE': 173,
 'CONFIDENTIAL INTERVIEW': 174,
 'CONFUSED CANDLES': 175,
 'CONGENIALITY QUEST': 176,
 'CONNECTICUT TRAMP': 177,
 'CONNECTION MICROCOSMOS': 178,
 'CONQUERER NUTS': 179,
 'CONSPIRACY SPIRIT': 180,
 'CONTACT ANONYMOUS': 181,
 'CONTROL ANTHEM': 182,
 'CONVERSATION DOWNHILL': 183,
 'CORE SUIT': 184,
 'COWBOY DOOM': 185,
 'CRAFT OUTFIELD': 186,
 'CRANES RESERVOIR': 187,
 'CRAZY HOME': 188,
 'CREATURES SHAKESPEARE': 189,
 'CREEPERS KANE': 190,
 'CROOKED FROGMEN': 191,
 'CROSSING DIVORCE': 192,
 'CROSSROADS CASUALTIES': 193,
 'CROW GREASE': 194,
 'CROWDS TELEMARK': 195,
 'CRUELTY UNFORGIVEN': 196,
 'CRUSADE HONEY': 197,
 'CRYSTAL BREAKING': 198,
 'CUPBOARD SINNERS': 199,
 'CURTAIN VIDEOTAPE': 200,
 'CYCLONE FAMILY': 201,
 'DADDY PITTSBURGH': 202,
 'DAISY MENAGERIE': 203,
 'DALMATIONS SWEDEN': 204,
 'DANCES NONE': 205,
 'DANCING FEVER': 206,
 'DANGEROUS UPTOWN': 207,
 'DARES PLUTO': 208,
 'DARKNESS WAR': 209,
 'DARKO DORADO': 210,
 'DARLING BREAKING': 211,
 'DARN FORRESTER': 212,
 'DATE SPEED': 213,
 'DAUGHTER MADIGAN': 214,
 'DAWN POND': 215,
 'DAY UNFAITHFUL': 216,
 'DAZED PUNK': 217,
 'DECEIVER BETRAYED': 218,
 'DEEP CRUSADE': 219,
 'DEER VIRGINIAN': 220,
 'DELIVERANCE MULHOLLAND': 221,
 'DESERT POSEIDON': 222,
 'DESIRE ALIEN': 223,
 'DESPERATE TRAINSPOTTING': 224,
 'DESTINATION JERK': 225,
 'DESTINY SATURDAY': 226,
 'DETAILS PACKER': 227,
 'DETECTIVE VISION': 228,
 'DEVIL DESIRE': 229,
 'DIARY PANIC': 230,
 'DINOSAUR SECRETARY': 231,
 'DIRTY ACE': 232,
 'DISCIPLE MOTHER': 233,
 'DISTURBING SCARFACE': 234,
 'DIVIDE MONSTER': 235,
 'DIVINE RESURRECTION': 236,
 'DIVORCE SHINING': 237,
 'DOCTOR GRAIL': 238,
 'DOGMA FAMILY': 239,
 'DOLLS RAGE': 240,
 'DONNIE ALLEY': 241,
 'DOOM DANCING': 242,
 'DOORS PRESIDENT': 243,
 'DORADO NOTTING': 244,
 'DOUBLE WRATH': 245,
 'DOUBTFIRE LABYRINTH': 246,
 'DOWNHILL ENOUGH': 247,
 'DOZEN LION': 248,
 'DRACULA CRYSTAL': 249,
 'DRAGON SQUAD': 250,
 'DRAGONFLY STRANGERS': 251,
 'DREAM PICKUP': 252,
 'DRIFTER COMMANDMENTS': 253,
 'DRIVER ANNIE': 254,
 'DRIVING POLISH': 255,
 'DROP WATERFRONT': 256,
 'DRUMLINE CYCLONE': 257,
 'DRUMS DYNAMITE': 258,
 'DUCK RACER': 259,
 'DUDE BLINDNESS': 260,
 'DUFFEL APOCALYPSE': 261,
 'DUMBO LUST': 262,
 'DURHAM PANKY': 263,
 'DWARFS ALTER': 264,
 'DYING MAKER': 265,
 'DYNAMITE TARZAN': 266,
 'EAGLES PANKY': 267,
 'EARLY HOME': 268,
 'EARRING INSTINCT': 269,
 'EARTH VISION': 270,
 'EASY GLADIATOR': 271,
 'EDGE KISSING': 272,
 'EFFECT GLADIATOR': 273,
 'EGG IGBY': 274,
 'EGYPT TENENBAUMS': 275,
 'ELEMENT FREDDY': 276,
 'ELEPHANT TROJAN': 277,
 'ELF MURDER': 278,
 'ELIZABETH SHANE': 279,
 'EMPIRE MALKOVICH': 280,
 'ENCINO ELF': 281,
 'ENCOUNTERS CURTAIN': 282,
 'ENDING CROWDS': 283,
 'ENEMY ODDS': 284,
 'ENGLISH BULWORTH': 285,
 'ENOUGH RAGING': 286,
 'ENTRAPMENT SATISFACTION': 287,
 'ESCAPE METROPOLIS': 288,
 'EVE RESURRECTION': 289,
 'EVERYONE CRAFT': 290,
 'EVOLUTION ALTER': 291,
 'EXCITEMENT EVE': 292,
 'EXORCIST STING': 293,
 'EXPECATIONS NATURAL': 294,
 'EXPENDABLE STALLION': 295,
 'EXPRESS LONELY': 296,
 'EXTRAORDINARY CONQUERER': 297,
 'EYES DRIVING': 298,
 'FACTORY DRAGON': 299,
 'FALCON VOLUME': 300,
 'FAMILY SWEET': 301,
 'FANTASIA PARK': 302,
 'FANTASY TROOPERS': 303,
 'FARGO GANDHI': 304,
 'FATAL HAUNTED': 305,
 'FEATHERS METAL': 306,
 'FELLOWSHIP AUTUMN': 307,
 'FERRIS MOTHER': 308,
 'FEUD FROGMEN': 309,
 'FEVER EMPIRE': 310,
 'FICTION CHRISTMAS': 311,
 'FIDDLER LOST': 312,
 'FIDELITY DEVIL': 313,
 'FIGHT JAWBREAKER': 314,
 'FINDING ANACONDA': 315,
 'FIRE WOLVES': 316,
 'FIREBALL PHILADELPHIA': 317,
 'FIREHOUSE VIETNAM': 318,
 'FISH OPUS': 319,
 'FLAMINGOS CONNECTICUT': 320,
 'FLASH WARS': 321,
 'FLATLINERS KILLER': 322,
 'FLIGHT LIES': 323,
 'FLINTSTONES HAPPINESS': 324,
 'FLOATS GARDEN': 325,
 'FLYING HOOK': 326,
 'FOOL MOCKINGBIRD': 327,
 'FOREVER CANDIDATE': 328,
 'FORREST SONS': 329,
 'FORRESTER COMANCHEROS': 330,
 'FORWARD TEMPLE': 331,
 'FRANKENSTEIN STRANGER': 332,
 'FREAKY POCUS': 333,
 'FREDDY STORM': 334,
 'FREEDOM CLEOPATRA': 335,
 'FRENCH HOLIDAY': 336,
 'FRIDA SLIPPER': 337,
 'FRISCO FORREST': 338,
 'FROGMEN BREAKING': 339,
 'FRONTIER CABIN': 340,
 'FROST HEAD': 341,
 'FUGITIVE MAGUIRE': 342,
 'FULL FLATLINERS': 343,
 'FURY MURDER': 344,
 'GABLES METROPOLIS': 345,
 'GALAXY SWEETHEARTS': 346,
 'GAMES BOWFINGER': 347,
 'GANDHI KWAI': 348,
 'GANGS PRIDE': 349,
 'GARDEN ISLAND': 350,
 'GASLIGHT CRUSADE': 351,
 'GATHERING CALENDAR': 352,
 'GENTLEMEN STAGE': 353,
 'GHOST GROUNDHOG': 354,
 'GHOSTBUSTERS ELF': 355,
 'GIANT TROOPERS': 356,
 'GILBERT PELICAN': 357,
 'GILMORE BOILED': 358,
 'GLADIATOR WESTWARD': 359,
 'GLASS DYING': 360,
 'GLEAMING JAWBREAKER': 361,
 'GLORY TRACY': 362,
 'GO PURPLE': 363,
 'GODFATHER DIARY': 364,
 'GOLD RIVER': 365,
 'GOLDFINGER SENSIBILITY': 366,
 'GOLDMINE TYCOON': 367,
 'GONE TROUBLE': 368,
 'GOODFELLAS SALUTE': 369,
 'GORGEOUS BINGO': 370,
 'GOSFORD DONNIE': 371,
 'GRACELAND DYNAMITE': 372,
 'GRADUATE LORD': 373,
 'GRAFFITI LOVE': 374,
 'GRAIL FRANKENSTEIN': 375,
 'GRAPES FURY': 376,
 'GREASE YOUTH': 377,
 'GREATEST NORTH': 378,
 'GREEDY ROOTS': 379,
 'GREEK EVERYONE': 380,
 'GRINCH MASSAGE': 381,
 'GRIT CLOCKWORK': 382,
 'GROOVE FICTION': 383,
 'GROSSE WONDERFUL': 384,
 'GROUNDHOG UNCUT': 385,
 'GUMP DATE': 386,
 'GUN BONNIE': 387,
 'GUNFIGHT MOON': 388,
 'GUNFIGHTER MUSSOLINI': 389,
 'GUYS FALCON': 390,
 'HALF OUTFIELD': 391,
 'HALL CASSIDY': 392,
 'HALLOWEEN NUTS': 393,
 'HAMLET WISDOM': 394,
 'HANDICAP BOONDOCK': 395,
 'HANGING DEEP': 396,
 'HANKY OCTOBER': 397,
 'HANOVER GALAXY': 398,
 'HAPPINESS UNITED': 399,
 'HARDLY ROBBERS': 400,
 'HAROLD FRENCH': 401,
 'HARPER DYING': 402,
 'HARRY IDAHO': 403,
 'HATE HANDICAP': 404,
 'HAUNTED ANTITRUST': 405,
 'HAUNTING PIANIST': 406,
 'HAWK CHILL': 407,
 'HEAD STRANGER': 408,
 'HEARTBREAKERS BRIGHT': 409,
 'HEAVEN FREEDOM': 410,
 'HEAVENLY GUN': 411,
 'HEAVYWEIGHTS BEAST': 412,
 'HEDWIG ALTER': 413,
 'HELLFIGHTERS SIERRA': 414,
 'HIGH ENCINO': 415,
 'HIGHBALL POTTER': 416,
 'HILLS NEIGHBORS': 417,
 'HOBBIT ALIEN': 418,
 'HOCUS FRIDA': 419,
 'HOLES BRANNIGAN': 420,
 'HOLIDAY GAMES': 421,
 'HOLLOW JEOPARDY': 422,
 'HOLLYWOOD ANONYMOUS': 423,
 'HOLOCAUST HIGHBALL': 424,
 'HOLY TADPOLE': 425,
 'HOME PITY': 426,
 'HOMEWARD CIDER': 427,
 'HOMICIDE PEACH': 428,
 'HONEY TIES': 429,
 'HOOK CHARIOTS': 430,
 'HOOSIERS BIRDCAGE': 431,
 'HOPE TOOTSIE': 432,
 'HORN WORKING': 433,
 'HORROR REIGN': 434,
 'HOTEL HAPPINESS': 435,
 'HOURS RAGE': 436,
 'HOUSE DYNAMITE': 437,
 'HUMAN GRAFFITI': 438,
 'HUNCHBACK IMPOSSIBLE': 439,
 'HUNGER ROOF': 440,
 'HUNTER ALTER': 441,
 'HUNTING MUSKETEERS': 442,
 'HURRICANE AFFAIR': 443,
 'HUSTLER PARTY': 444,
 'HYDE DOCTOR': 445,
 'HYSTERICAL GRAIL': 446,
 'ICE CROSSING': 447,
 'IDAHO LOVE': 448,
 'IDENTITY LOVER': 449,
 'IDOLS SNATCHERS': 450,
 'IGBY MAKER': 451,
 'ILLUSION AMELIE': 452,
 'IMAGE PRINCESS': 453,
 'IMPACT ALADDIN': 454,
 'IMPOSSIBLE PREJUDICE': 455,
 'INCH JET': 456,
 'INDEPENDENCE HOTEL': 457,
 'INDIAN LOVE': 458,
 'INFORMER DOUBLE': 459,
 'INNOCENT USUAL': 460,
 'INSECTS STONE': 461,
 'INSIDER ARIZONA': 462,
 'INSTINCT AIRPORT': 463,
 'INTENTIONS EMPIRE': 464,
 'INTERVIEW LIAISONS': 465,
 'INTOLERABLE INTENTIONS': 466,
 'INTRIGUE WORST': 467,
 'INVASION CYCLONE': 468,
 'IRON MOON': 469,
 'ISHTAR ROCKETEER': 470,
 'ISLAND EXORCIST': 471,
 'ITALIAN AFRICAN': 472,
 'JACKET FRISCO': 473,
 'JADE BUNCH': 474,
 'JAPANESE RUN': 475,
 'JASON TRAP': 476,
 'JAWBREAKER BROOKLYN': 477,
 'JAWS HARRY': 478,
 'JEDI BENEATH': 479,
 'JEEPERS WEDDING': 480,
 'JEKYLL FROGMEN': 481,
 'JEOPARDY ENCINO': 482,
 'JERICHO MULAN': 483,
 'JERK PAYCHECK': 484,
 'JERSEY SASSY': 485,
 'JET NEIGHBORS': 486,
 'JINGLE SAGEBRUSH': 487,
 'JOON NORTHWEST': 488,
 'JUGGLER HARDLY': 489,
 'JUMANJI BLADE': 490,
 'JUMPING WRATH': 491,
 'JUNGLE CLOSER': 492,
 'KANE EXORCIST': 493,
 'KARATE MOON': 494,
 'KENTUCKIAN GIANT': 495,
 'KICK SAVANNAH': 496,
 'KILL BROTHERHOOD': 497,
 'KILLER INNOCENT': 498,
 'KING EVOLUTION': 499,
 'KISS GLORY': 500,
 'KISSING DOLLS': 501,
 'KNOCK WARLOCK': 502,
 'KRAMER CHOCOLATE': 503,
 'KWAI HOMEWARD': 504,
 'LABYRINTH LEAGUE': 505,
 'LADY STAGE': 506,
 'LADYBUGS ARMAGEDDON': 507,
 'LAMBS CINCINATTI': 508,
 'LANGUAGE COWBOY': 509,
 'LAWLESS VISION': 510,
 'LAWRENCE LOVE': 511,
 'LEAGUE HELLFIGHTERS': 512,
 'LEATHERNECKS DWARFS': 513,
 'LEBOWSKI SOLDIERS': 514,
 'LEGALLY SECRETARY': 515,
 'LEGEND JEDI': 516,
 'LESSON CLEOPATRA': 517,
 'LIAISONS SWEET': 518,
 'LIBERTY MAGNIFICENT': 519,
 'LICENSE WEEKEND': 520,
 'LIES TREATMENT': 521,
 'LIFE TWISTED': 522,
 'LIGHTS DEER': 523,
 'LION UNCUT': 524,
 'LOATHING LEGALLY': 525,
 'LOCK REAR': 526,
 'LOLA AGENT': 527,
 'LOLITA WORLD': 528,
 'LONELY ELEPHANT': 529,
 'LORD ARIZONA': 530,
 'LOSE INCH': 531,
 'LOSER HUSTLER': 532,
 'LOST BIRD': 533,
 'LOUISIANA HARRY': 534,
 'LOVE SUICIDES': 535,
 'LOVELY JINGLE': 536,
 'LOVER TRUMAN': 537,
 'LOVERBOY ATTACKS': 538,
 'LUCK OPUS': 539,
 'LUCKY FLYING': 540,
 'LUKE MUMMY': 541,
 'LUST LOCK': 542,
 'MADIGAN DORADO': 543,
 'MADISON TRAP': 544,
 'MADNESS ATTACKS': 545,
 'MADRE GABLES': 546,
 'MAGIC MALLRATS': 547,
 'MAGNIFICENT CHITTY': 548,
 'MAGNOLIA FORRESTER': 549,
 'MAGUIRE APACHE': 550,
 'MAIDEN HOME': 551,
 'MAJESTIC FLOATS': 552,
 'MAKER GABLES': 553,
 'MALKOVICH PET': 554,
 'MALLRATS UNITED': 555,
 'MALTESE HOPE': 556,
 'MANCHURIAN CURTAIN': 557,
 'MANNEQUIN WORST': 558,
 'MARRIED GO': 559,
 'MARS ROMAN': 560,
 'MASK PEACH': 561,
 'MASKED BUBBLE': 562,
 'MASSACRE USUAL': 563,
 'MASSAGE IMAGE': 564,
 'MATRIX SNOWMAN': 565,
 'MAUDE MOD': 566,
 'MEET CHOCOLATE': 567,
 'MEMENTO ZOOLANDER': 568,
 'MENAGERIE RUSHMORE': 569,
 'MERMAID INSECTS': 570,
 'METAL ARMAGEDDON': 571,
 'METROPOLIS COMA': 572,
 'MICROCOSMOS PARADISE': 573,
 'MIDNIGHT WESTWARD': 574,
 'MIDSUMMER GROUNDHOG': 575,
 'MIGHTY LUCK': 576,
 'MILE MULAN': 577,
 'MILLION ACE': 578,
 'MINDS TRUMAN': 579,
 'MINE TITANS': 580,
 'MINORITY KISS': 581,
 'MIRACLE VIRTUAL': 582,
 'MISSION ZOOLANDER': 583,
 'MIXED DOORS': 584,
 'MOB DUFFEL': 585,
 'MOCKINGBIRD HOLLYWOOD': 586,
 'MOD SECRETARY': 587,
 'MODEL FISH': 588,
 'MODERN DORADO': 589,
 'MONEY HAROLD': 590,
 'MONSOON CAUSE': 591,
 'MONSTER SPARTACUS': 592,
 'MONTEREY LABYRINTH': 593,
 'MONTEZUMA COMMAND': 594,
 'MOON BUNCH': 595,
 'MOONSHINE CABIN': 596,
 'MOONWALKER FOOL': 597,
 'MOSQUITO ARMAGEDDON': 598,
 'MOTHER OLEANDER': 599,
 'MOTIONS DETAILS': 600,
 'MOULIN WAKE': 601,
 'MOURNING PURPLE': 602,
 'MOVIE SHAKESPEARE': 603,
 'MULAN MOON': 604,
 'MULHOLLAND BEAST': 605,
 'MUMMY CREATURES': 606,
 'MUPPET MILE': 607,
 'MURDER ANTITRUST': 608,
 'MUSCLE BRIGHT': 609,
 'MUSIC BOONDOCK': 610,
 'MUSKETEERS WAIT': 611,
 'MUSSOLINI SPOILERS': 612,
 'MYSTIC TRUMAN': 613,
 'NAME DETECTIVE': 614,
 'NASH CHOCOLAT': 615,
 'NATIONAL STORY': 616,
 'NATURAL STOCK': 617,
 'NECKLACE OUTBREAK': 618,
 'NEIGHBORS CHARADE': 619,
 'NEMO CAMPUS': 620,
 'NETWORK PEAK': 621,
 'NEWSIES STORY': 622,
 'NEWTON LABYRINTH': 623,
 'NIGHTMARE CHILL': 624,
 'NONE SPIKING': 625,
 'NOON PAPI': 626,
 'NORTH TEQUILA': 627,
 'NORTHWEST POLISH': 628,
 'NOTORIOUS REUNION': 629,
 'NOTTING SPEAKEASY': 630,
 'NOVOCAINE FLIGHT': 631,
 'NUTS TIES': 632,
 'OCTOBER SUBMARINE': 633,
 'ODDS BOOGIE': 634,
 'OKLAHOMA JUMANJI': 635,
 'OLEANDER CLUE': 636,
 'OPEN AFRICAN': 637,
 'OPERATION OPERATION': 638,
 'OPPOSITE NECKLACE': 639,
 'OPUS ICE': 640,
 'ORANGE GRAPES': 641,
 'ORDER BETRAYED': 642,
 'ORIENT CLOSER': 643,
 'OSCAR GOLD': 644,
 'OTHERS SOUP': 645,
 'OUTBREAK DIVINE': 646,
 'OUTFIELD MASSACRE': 647,
 'OUTLAW HANKY': 648,
 'OZ LIAISONS': 649,
 'PACIFIC AMISTAD': 650,
 'PACKER MADIGAN': 651,
 'PAJAMA JAWBREAKER': 652,
 'PANIC CLUB': 653,
 'PANKY SUBMARINE': 654,
 'PANTHER REDS': 655,
 'PAPI NECKLACE': 656,
 'PARADISE SABRINA': 657,
 'PARIS WEEKEND': 658,
 'PARK CITIZEN': 659,
 'PARTY KNOCK': 660,
 'PAST SUICIDES': 661,
 'PATHS CONTROL': 662,
 'PATIENT SISTER': 663,
 'PATRIOT ROMAN': 664,
 'PATTON INTERVIEW': 665,
 'PAYCHECK WAIT': 666,
 'PEACH INNOCENT': 667,
 'PEAK FOREVER': 668,
 'PEARL DESTINY': 669,
 'PELICAN COMFORTS': 670,
 'PERDITION FARGO': 671,
 'PERFECT GROOVE': 672,
 'PERSONAL LADYBUGS': 673,
 'PET HAUNTING': 674,
 'PHANTOM GLORY': 675,
 'PHILADELPHIA WIFE': 676,
 'PIANIST OUTFIELD': 677,
 'PICKUP DRIVING': 678,
 'PILOT HOOSIERS': 679,
 'PINOCCHIO SIMON': 680,
 'PIRATES ROXANNE': 681,
 'PITTSBURGH HUNCHBACK': 682,
 'PITY BOUND': 683,
 'PIZZA JUMANJI': 684,
 'PLATOON INSTINCT': 685,
 'PLUTO OLEANDER': 686,
 'POCUS PULP': 687,
 'POLISH BROOKLYN': 688,
 'POLLOCK DELIVERANCE': 689,
 'POND SEATTLE': 690,
 'POSEIDON FOREVER': 691,
 'POTLUCK MIXED': 692,
 'POTTER CONNECTICUT': 693,
 'PREJUDICE OLEANDER': 694,
 'PRESIDENT BANG': 695,
 'PRIDE ALAMO': 696,
 'PRIMARY GLASS': 697,
 'PRINCESS GIANT': 698,
 'PRIVATE DROP': 699,
 'PRIX UNDEFEATED': 700,
 'PSYCHO SHRUNK': 701,
 'PULP BEVERLY': 702,
 'PUNK DIVORCE': 703,
 'PURE RUNNER': 704,
 'PURPLE MOVIE': 705,
 'QUEEN LUKE': 706,
 'QUEST MUSSOLINI': 707,
 'QUILLS BULL': 708,
 'RACER EGG': 709,
 'RAGE GAMES': 710,
 'RAGING AIRPLANE': 711,
 'RAIDERS ANTITRUST': 712,
 'RAINBOW SHOCK': 713,
 'RANDOM GO': 714,
 'RANGE MOONWALKER': 715,
 'REAP UNFAITHFUL': 716,
 'REAR TRADING': 717,
 'REBEL AIRPORT': 718,
 'RECORDS ZORRO': 719,
 'REDEMPTION COMFORTS': 720,
 'REDS POCUS': 721,
 'REEF SALUTE': 722,
 'REIGN GENTLEMEN': 723,
 'REMEMBER DIARY': 724,
 'REQUIEM TYCOON': 725,
 'RESERVOIR ADAPTATION': 726,
 'RESURRECTION SILVERADO': 727,
 'REUNION WITCHES': 728,
 'RIDER CADDYSHACK': 729,
 'RIDGEMONT SUBMARINE': 730,
 'RIGHT CRANES': 731,
 'RINGS HEARTBREAKERS': 732,
 'RIVER OUTLAW': 733,
 'ROAD ROXANNE': 734,
 'ROBBERS JOON': 735,
 'ROBBERY BRIGHT': 736,
 'ROCK INSTINCT': 737,
 'ROCKETEER MOTHER': 738,
 'ROCKY WAR': 739,
 'ROLLERCOASTER BRINGING': 740,
 'ROMAN PUNK': 741,
 'ROOF CHAMPION': 742,
 'ROOM ROMAN': 743,
 'ROOTS REMEMBER': 744,
 'ROSES TREASURE': 745,
 'ROUGE SQUAD': 746,
 'ROXANNE REBEL': 747,
 'RUGRATS SHAKESPEARE': 748,
 'RULES HUMAN': 749,
 'RUN PACIFIC': 750,
 'RUNAWAY TENENBAUMS': 751,
 'RUNNER MADIGAN': 752,
 'RUSH GOODFELLAS': 753,
 'RUSHMORE MERMAID': 754,
 'SABRINA MIDNIGHT': 755,
 'SADDLE ANTITRUST': 756,
 'SAGEBRUSH CLUELESS': 757,
 'SAINTS BRIDE': 758,
 'SALUTE APOLLO': 759,
 'SAMURAI LION': 760,
 'SANTA PARIS': 761,
 'SASSY PACKER': 762,
 'SATISFACTION CONFIDENTIAL': 763,
 'SATURDAY LAMBS': 764,
 'SATURN NAME': 765,
 'SAVANNAH TOWN': 766,
 'SCALAWAG DUCK': 767,
 'SCARFACE BANG': 768,
 'SCHOOL JACKET': 769,
 'SCISSORHANDS SLUMS': 770,
 'SCORPION APOLLO': 771,
 'SEA VIRGIN': 772,
 'SEABISCUIT PUNK': 773,
 'SEARCHERS WAIT': 774,
 'SEATTLE EXPECATIONS': 775,
 'SECRET GROUNDHOG': 776,
 'SECRETARY ROUGE': 777,
 'SECRETS PARADISE': 778,
 'SENSE GREEK': 779,
 'SENSIBILITY REAR': 780,
 'SEVEN SWARM': 781,
 'SHAKESPEARE SADDLE': 782,
 'SHANE DARKNESS': 783,
 'SHANGHAI TYCOON': 784,
 'SHAWSHANK BUBBLE': 785,
 'SHEPHERD MIDSUMMER': 786,
 'SHINING ROSES': 787,
 'SHIP WONDERLAND': 788,
 'SHOCK CABIN': 789,
 'SHOOTIST SUPERFLY': 790,
 'SHOW LORD': 791,
 'SHREK LICENSE': 792,
 'SHRUNK DIVINE': 793,
 'SIDE ARK': 794,
 'SIEGE MADRE': 795,
 'SIERRA DIVIDE': 796,
 'SILENCE KANE': 797,
 'SILVERADO GOLDFINGER': 798,
 'SIMON NORTH': 799,
 'SINNERS ATLANTIS': 800,
 'SISTER FREDDY': 801,
 'SKY MIRACLE': 802,
 'SLACKER LIAISONS': 803,
 'SLEEPING SUSPECTS': 804,
 'SLEEPLESS MONSOON': 805,
 'SLEEPY JAPANESE': 806,
 'SLEUTH ORIENT': 807,
 'SLING LUKE': 808,
 'SLIPPER FIDELITY': 809,
 'SLUMS DUCK': 810,
 'SMILE EARRING': 811,
 'SMOKING BARBARELLA': 812,
 'SMOOCHY CONTROL': 813,
 'SNATCH SLIPPER': 814,
 'SNATCHERS MONTEZUMA': 815,
 'SNOWMAN ROLLERCOASTER': 816,
 'SOLDIERS EVOLUTION': 817,
 'SOMETHING DUCK': 818,
 'SONG HEDWIG': 819,
 'SONS INTERVIEW': 820,
 'SORORITY QUEEN': 821,
 'SOUP WISDOM': 822,
 'SOUTH WAIT': 823,
 'SPARTACUS CHEAPER': 824,
 'SPEAKEASY DATE': 825,
 'SPEED SUIT': 826,
 'SPICE SORORITY': 827,
 'SPIKING ELEMENT': 828,
 'SPINAL ROCKY': 829,

In [33]:
actor_dict

{'PENELOPE_GUINESS': 1,
 'NICK_WAHLBERG': 2,
 'ED_CHASE': 3,
 'JENNIFER_DAVIS': 4,
 'JOHNNY_LOLLOBRIGIDA': 5,
 'BETTE_NICHOLSON': 6,
 'GRACE_MOSTEL': 7,
 'MATTHEW_JOHANSSON': 8,
 'JOE_SWANK': 9,
 'CHRISTIAN_GABLE': 10,
 'ZERO_CAGE': 11,
 'KARL_BERRY': 12,
 'UMA_WOOD': 13,
 'VIVIEN_BERGEN': 14,
 'CUBA_OLIVIER': 15,
 'FRED_COSTNER': 16,
 'HELEN_VOIGHT': 17,
 'DAN_TORN': 18,
 'BOB_FAWCETT': 19,
 'LUCILLE_TRACY': 20,
 'KIRSTEN_PALTROW': 21,
 'ELVIS_MARX': 22,
 'SANDRA_KILMER': 23,
 'CAMERON_STREEP': 24,
 'KEVIN_BLOOM': 25,
 'RIP_CRAWFORD': 26,
 'JULIA_MCQUEEN': 27,
 'WOODY_HOFFMAN': 28,
 'ALEC_WAYNE': 29,
 'SANDRA_PECK': 30,
 'SISSY_SOBIESKI': 31,
 'TIM_HACKMAN': 32,
 'MILLA_PECK': 33,
 'AUDREY_OLIVIER': 34,
 'JUDY_DEAN': 35,
 'BURT_DUKAKIS': 36,
 'VAL_BOLGER': 37,
 'TOM_MCKELLEN': 38,
 'GOLDIE_BRODY': 39,
 'JOHNNY_CAGE': 40,
 'JODIE_DEGENERES': 41,
 'TOM_MIRANDA': 42,
 'KIRK_JOVOVICH': 43,
 'NICK_STALLONE': 44,
 'REESE_KILMER': 45,
 'PARKER_GOLDBERG': 46,
 'JULIA_BARRYMORE': 47,
 'FRANCES_DAY-LEWIS': 48,
 'ANNE_CRONYN': 49,
 'NATALIE_HOPKINS': 50,
 'GARY_PHOENIX': 51,
 'CARMEN_HUNT': 52,
 'MENA_TEMPLE': 53,
 'PENELOPE_PINKETT': 54,
 'FAY_KILMER': 55,
 'DAN_HARRIS': 56,
 'JUDE_CRUISE': 57,
 'CHRISTIAN_AKROYD': 58,
 'DUSTIN_TAUTOU': 59,
 'HENRY_BERRY': 60,
 'CHRISTIAN_NEESON': 61,
 'JAYNE_NEESON': 62,
 'CAMERON_WRAY': 63,
 'RAY_JOHANSSON': 64,
 'ANGELA_HUDSON': 65,
 'MARY_TANDY': 66,
 'JESSICA_BAILEY': 67,
 'RIP_WINSLET': 68,
 'KENNETH_PALTROW': 69,
 'MICHELLE_MCCONAUGHEY': 70,
 'ADAM_GRANT': 71,
 'SEAN_WILLIAMS': 72,
 'GARY_PENN': 73,
 'MILLA_KEITEL': 74,
 'BURT_POSEY': 75,
 'ANGELINA_ASTAIRE': 76,
 'CARY_MCCONAUGHEY': 77,
 'GROUCHO_SINATRA': 78,
 'MAE_HOFFMAN': 79,
 'RALPH_CRUZ': 80,
 'SCARLETT_DAMON': 81,
 'WOODY_JOLIE': 82,
 'BEN_WILLIS': 83,
 'JAMES_PITT': 84,
 'MINNIE_ZELLWEGER': 85,
 'GREG_CHAPLIN': 86,
 'SPENCER_PECK': 87,
 'KENNETH_PESCI': 88,
 'CHARLIZE_DENCH': 89,
 'SEAN_GUINESS': 90,
 'CHRISTOPHER_BERRY': 91,
 'KIRSTEN_AKROYD': 92,
 'ELLEN_PRESLEY': 93,
 'KENNETH_TORN': 94,
 'DARYL_WAHLBERG': 95,
 'GENE_WILLIS': 96,
 'MEG_HAWKE': 97,
 'CHRIS_BRIDGES': 98,
 'JIM_MOSTEL': 99,
 'SPENCER_DEPP': 100,
 'SUSAN_DAVIS': 101,
 'WALTER_TORN': 102,
 'MATTHEW_LEIGH': 103,
 'PENELOPE_CRONYN': 104,
 'SIDNEY_CROWE': 105,
 'GROUCHO_DUNST': 106,
 'GINA_DEGENERES': 107,
 'WARREN_NOLTE': 108,
 'SYLVESTER_DERN': 109,
 'CAMERON_ZELLWEGER': 110,
 'RUSSELL_BACALL': 111,
 'MORGAN_HOPKINS': 112,
 'MORGAN_MCDORMAND': 113,
 'HARRISON_BALE': 114,
 'DAN_STREEP': 115,
 'RENEE_TRACY': 116,
 'CUBA_ALLEN': 117,
 'WARREN_JACKMAN': 118,
 'PENELOPE_MONROE': 119,
 'LIZA_BERGMAN': 120,
 'SALMA_NOLTE': 121,
 'JULIANNE_DENCH': 122,
 'SCARLETT_BENING': 123,
 'ALBERT_NOLTE': 124,
 'FRANCES_TOMEI': 125,
 'KEVIN_GARLAND': 126,
 'CATE_MCQUEEN': 127,
 'DARYL_CRAWFORD': 128,
 'GRETA_KEITEL': 129,
 'JANE_JACKMAN': 130,
 'ADAM_HOPPER': 131,
 'RICHARD_PENN': 132,
 'GENE_HOPKINS': 133,
 'RITA_REYNOLDS': 134,
 'ED_MANSFIELD': 135,
 'MORGAN_WILLIAMS': 136,
 'LUCILLE_DEE': 137,
 'EWAN_GOODING': 138,
 'WHOOPI_HURT': 139,
 'CATE_HARRIS': 140,
 'JADA_RYDER': 141,
 'RIVER_DEAN': 142,
 'ANGELA_WITHERSPOON': 143,
 'KIM_ALLEN': 144,
 'ALBERT_JOHANSSON': 145,
 'FAY_WINSLET': 146,
 'EMILY_DEE': 147,
 'RUSSELL_TEMPLE': 148,
 'JAYNE_NOLTE': 149,
 'GEOFFREY_HESTON': 150,
 'BEN_HARRIS': 151,
 'MINNIE_KILMER': 152,
 'MERYL_GIBSON': 153,
 'IAN_TANDY': 154,
 'FAY_WOOD': 155,
 'GRETA_MALDEN': 156,
 'VIVIEN_BASINGER': 157,
 'LAURA_BRODY': 158,
 'CHRIS_DEPP': 159,
 'HARVEY_HOPE': 160,
 'OPRAH_KILMER': 161,
 'CHRISTOPHER_WEST': 162,
 'HUMPHREY_WILLIS': 163,
 'AL_GARLAND': 164,
 'NICK_DEGENERES': 165,
 'LAURENCE_BULLOCK': 166,
 'WILL_WILSON': 167,
 'KENNETH_HOFFMAN': 168,
 'MENA_HOPPER': 169,
 'OLYMPIA_PFEIFFER': 170,
 'GROUCHO_WILLIAMS': 171,
 'ALAN_DREYFUSS': 172,
 'MICHAEL_BENING': 173,
 'WILLIAM_HACKMAN': 174,
 'JON_CHASE': 175,
 'GENE_MCKELLEN': 176,
 'LISA_MONROE': 177,
 'ED_GUINESS': 178,
 'JEFF_SILVERSTONE': 179,
 'MATTHEW_CARREY': 180,
 'DEBBIE_AKROYD': 181,
 'RUSSELL_CLOSE': 182,
 'HUMPHREY_GARLAND': 183,
 'MICHAEL_BOLGER': 184,
 'JULIA_ZELLWEGER': 185,
 'RENEE_BALL': 186,
 'ROCK_DUKAKIS': 187,
 'CUBA_BIRCH': 188,
 'AUDREY_BAILEY': 189,
 'GREGORY_GOODING': 190,
 'JOHN_SUVARI': 191,
 'BURT_TEMPLE': 192,
 'MERYL_ALLEN': 193,
 'JAYNE_SILVERSTONE': 194,
 'BELA_WALKEN': 195,
 'REESE_WEST': 196,
 'MARY_KEITEL': 197,
 'JULIA_FAWCETT': 198,
 'THORA_TEMPLE': 199}

In [34]:
# Usamos estos diccionarios para rellenar las columnas:

actorfilm['film_id'] = [film_dict[i] for i in actorfilm.title]
actorfilm['actor_id'] = [actor_dict[i] for i in actorfilm.name]

actorfilm.head()

# Contamos cuántos actores de la tabla 'actor' no están en la columna mixta, y lo mismo con las 
# películas de 'film': 

c1 = film.shape[0] - actorfilm.film_id.unique().shape[0]
c2 = actor.shape[0] - actorfilm.actor_id.unique().shape[0]


display(actorfilm)

print('\nHay',c1,'películas que no aparecen en la lista de conexión actorfilm, y',c2,'actores que tampoco aparecen.')

,title,release_year,category_id,name,film_id,actor_id
0,ACADEMY DINOSAUR,2006,6,PENELOPE_GUINESS,1,1
1,ANACONDA CONFESSIONS,2006,2,PENELOPE_GUINESS,23,1
2,ANGELS LIFE,2006,13,PENELOPE_GUINESS,25,1
3,BULWORTH COMMANDMENTS,2006,10,PENELOPE_GUINESS,106,1
4,CHEAPER CLYDE,2006,14,PENELOPE_GUINESS,140,1
...,...,...,...,...,...,...
995,COMANCHEROS ENEMY,2006,3,GOLDIE_BRODY,168,39
996,DAISY MENAGERIE,2006,14,GOLDIE_BRODY,203,39
997,DESERT POSEIDON,2006,11,GOLDIE_BRODY,222,39
998,EVERYONE CRAFT,2006,9,GOLDIE_BRODY,290,39
999,EXORCIST STING,2006,15,GOLDIE_BRODY,293,39

Hay 386 películas que no aparecen en la lista de conexión actorfilm, y 160 actores que tampoco aparecen.

Parece que hay muchos actores de la tabla 'actor' y muchas películas de la tabla 'film' que no están relacionados a través de la tabla de conexión. Quizá sea porque el dueño del videoclub no las tiene en el inventario, pero de cualquier manera no nos estorban. Lo importante es tener bien etiquetadas las conexiones entre ambas tablas en lo posible.. deshagámonos de 'title', 'name' y 'release_year' (esta última ya está en la tabla 'film').

In [35]:
actorfilm.drop(columns = ['release_year','name','title'], inplace = True)

actorfilm # Ale, tabla limpita

     category_id  film_id  actor_id
0              6        1         1
1              2       23         1
2             13       25         1
3             10      106         1
4             14      140         1
..           ...      ...       ...
995            3      168        39
996           14      203        39
997           11      222        39
998            9      290        39
999           15      293        39

[1000 rows x 3 columns]

# Tabla language

In [36]:
firstglance(language)

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

Shape: (6, 3)

Null values count:

language_id    0
name           0
last_update    0
dtype: int64

Table info:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

None

Vaya tabla más enana. Parece que todas las películas que tenemos están disponibles en inglés (id = 1 en la tabla film), pero está bien no haber quitado esa columna porque según los datos parece que nuestro emprendedor tiene intención de tener películas en más idiomas en un futuro.

Guardamos el last_update fuera, lo metemos en la tabla de updates y a correr.

In [37]:
a = language.last_update[0]
updates = pd.concat([updates, pd.DataFrame({'table': 'language','last_update':[a]})], axis = 0)
language.drop(columns = 'last_update', inplace = True)

# Cambiemos el nombre de las columnas:
language.columns = ['id','lan']

# Vamos a añadir el idioma desconocido con id 7 que mencionamos antes:
language = pd.concat([language, pd.DataFrame({'id': 7,'lan':['Unknown']})], axis = 0)

language # ¡listo!

   id       lan
0   1   English
1   2   Italian
2   3  Japanese
3   4  Mandarin
4   5    French
5   6    German
0   7   Unknown

# Tabla rental

In [38]:
# Vamos a ver qué tiene dentro:

firstglance(rental)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

Shape: (1000, 7)

Null values count:

rental_id       0
rental_date     0
inventory_id    0
customer_id     0
return_date     0
staff_id        0
last_update     0
dtype: int64

Table info:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

None

Interesante. Parece que había clientes identificados, staff y demás, pero no hay una tabla externa con ellos. Sería útil tener una de cada, aunque fuera sólo con un único registro (no tiene sentido dejar los ids actuales si no tenemos nombres ni relaciones más allá), y dejarlas abiertas para que el dueño del negocio las use.
Primero hacemos lo propio con la columna de last_update y luego vamos a ello.

In [39]:
# Comprobamos que es un valor único:

rental.last_update.value_counts() # Comprobado. Columna fuera:

a = rental.last_update[0]
updates = pd.concat([updates, pd.DataFrame({'table': 'rental','last_update':[a]})], axis = 0)
rental.drop(columns = 'last_update', inplace = True)

rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [40]:
updates # Echemos un ojo de paso a cómo está nuestra tabla de updates

      table          last_update
0     actor  2006-02-15 04:34:33
0      film  2006-02-15 05:03:42
0  language  2006-02-15 05:02:19
0    rental  2006-02-15 21:30:53

Va bien, reiniciaremos el índice al final. Vamos a eliminar las columnas de staff_id y de customer_id,
y crearemos sendos dataframes vacíos (o bueno, con un único registro), para dejar la estructura de esas 
tablas hechas.

In [41]:
customers = pd.DataFrame({'cust_id':[1],'name':['JASON_BLUE'],'sex':['female'],'age':[29],'phone':['+34 675879554'],
                          'mail':'jbluecoulds@gmail.com','postal':[28766]}) 

# Metemos algunos campos que pueden ser útiles de cara a estudios estadísticos futuros, como el código postal, la
# edad o el género.

staff = pd.DataFrame({'staff_id':[1],'name':['JASON_BLUE'],'phone':['+34 675879554'],
                      'mail':'jbluecoulds@gmail.com'})

# En principio no vamos a dejar opción a que haya varias tiendas, así que no pondremos una columna de store_id 
# en staff.

display(customers)
display(staff)

,cust_id,name,sex,age,phone,mail,postal
0,1,JASON_BLUE,female,29,+34 675879554,jbluecoulds@gmail.com,28766

   staff_id        name          phone                   mail
0         1  JASON_BLUE  +34 675879554  jbluecoulds@gmail.com

Con respecto a los datos de clientes antiguos, es interesante conservarlos de cara a futuros estudios de mercado posibles. Sin embargo, el propósito de este proyecto es crear la estructura de la database, por lo que borraremos la información antigua y dejaremos un solo registro para tener la tabla de rental inicializada. 

Le diremos al empresario que se guarde el csv de datos originales para un futuro, y a correr. 
Además, añadiremos una columna con la duración del préstamo, y otra con el film_id para saber qué película ha alquilado. 

De esta manera será fácil desde la base de datos de SQL saber si el cliene ha respetado el límite de tiempo establecido en la tabla film o no.

In [42]:
rental.drop(index = list(range(1,rental.shape[0])), inplace = True)

rental['film_id'] = 1

# Primero convertimos las columnas de return_date y rental_date a formato fecha, que ahora mismo son strings:

# pd.to_datetime(pd.Series("2020-12-08"))
# change_format = date_sr.dt.strftime('%d/%m/%Y')

rental.return_date = pd.to_datetime(rental.return_date)
rental.rental_date = pd.to_datetime(rental.rental_date)
rental['rental_time'] = (rental.return_date - rental.rental_date).dt.days 

# Para la diferencia nos quedamos solo con los días enteros, que son los que interesan de cara al límite temporal
# de préstamo. Aún así nos quedamos con la fecha completa de alquiler y entrega incluyendo horas en las columnas
# originales.

# Reordenamos un poco las columnas y listo.

rental = rental.reindex(columns = ['rental_id','customer_id','film_id','inventory_id',
                                   'staff_id','rental_time','rental_date','return_date'])
rental.customer_id = 1
rental.inventory_id = 1

rental.head() # Hecho

,rental_id,customer_id,film_id,inventory_id,staff_id,rental_time,rental_date,return_date
0,1,1,1,1,1,1,2005-05-24 22:53:30,2005-05-26 22:04:30

# Tabla Inventory

In [43]:
firstglance(inventory)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

Shape: (1000, 4)

Null values count:

inventory_id    0
film_id         0
store_id        0
last_update     0
dtype: int64

Table info:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

None

In [44]:
# Empecemos por guardar el last_update en su sitio correspondiente:

a = inventory.last_update[0]
updates = pd.concat([updates, pd.DataFrame({'table': 'inventory','last_update':[a]})], axis = 0)
inventory.drop(columns = 'last_update', inplace = True)

inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

In [45]:
# Esta tabla tiene información sobre varias tiendas. Echemos un ojo a los value counts.

inventory.store_id.value_counts()

1    503
2    497
Name: store_id, dtype: int64

In [46]:
# Son dos... pero ya hemos dicho que de dos tiendas nada, que empezamos por una y ya vemos.
# Vamos a cargarnos esta columna y a ver cuántas pelis había en el inventario y cuántas repetidas:

inventory.drop(columns = 'store_id', inplace = True)

In [47]:
sum(inventory.inventory_id.unique() != range(1,1001))

0

In [48]:
# Vale, parece que había 1000 películas etiquetadas en el inventario en que ningún inventory_id se repite,
# van del 1 al 1000 sin huecos.

# Vamos a ver qué film_id había:

inventory.film_id.unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,  27,
        28,  29,  30,  31,  32,  34,  35,  37,  39,  40,  42,  43,  44,
        45,  46,  47,  48,  49,  50,  51,  52,  53,  54,  55,  56,  57,
        58,  59,  60,  61,  62,  63,  64,  65,  66,  67,  68,  69,  70,
        71,  72,  73,  74,  75,  76,  77,  78,  79,  80,  81,  82,  83,
        84,  85,  86,  88,  89,  90,  91,  92,  93,  94,  95,  96,  97,
        98,  99, 100, 101, 102, 103, 104, 105, 106, 107, 109, 110, 111,
       112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124,
       125, 126, 127, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138,
       139, 140, 141, 142, 143, 145, 146, 147, 149, 150, 151, 152, 153,
       154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166,
       167, 168, 169, 170, 172, 173, 174, 175, 176, 177, 178, 179, 180,
       181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 193, 194,
       196, 197, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209,
       210, 211, 212, 213, 214, 215, 216, 218, 219, 220, 222, 223])

In [49]:
# Vemos que hay algunos huecos, como por ejemplo el film_id 14 que no está o el 36. 
# Echemos un ojo al total de pelis distintas que había:

len(inventory.film_id.unique())

207

In [50]:
# Había 207 películas identificadas inventariadas. Vamos a ver cuántas de estas están en la tabla de actorfilm..

A = set(inventory.film_id.unique())
B = set(actorfilm.film_id.unique())

len(A.intersection(B))

135

In [51]:
# Vaya. Pues no todas las películas que había disponibles están registradas en actorfilm... 
# Se ve que hay cosillas que arreglar, pero no podemos hacerlo sin más información. 
# Dejémoslo estar, le diremos al dueño del negocio que tiene que completar algunas tablas y listo.

inventory.head() # Tabla hecha!

   inventory_id  film_id
0             1        1
1             2        1
2             3        1
3             4        1
4             5        1

# Tabla category

In [52]:
firstglance(category)

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

Shape: (16, 3)

Null values count:

category_id    0
name           0
last_update    0
dtype: int64

Table info:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 512.0+ bytes

None

In [53]:
# Echemos un ojo a todas las categorías:

category

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27

In [54]:
# Todo normal. Guardemos el last_update en su sitio:

a = category.last_update[0]
updates = pd.concat([updates, pd.DataFrame({'table': 'category','last_update':[a]})], axis = 0)
category.drop(columns = 'last_update', inplace = True)

# Cambiemos el nombre de la columna 'name' por 'cat', para que sea más claro:

category.columns = ['id','cat']

# Añadimos un id al final, el 17, para películas sin categorizar aún:

category = pd.concat([category, pd.DataFrame({'id': 17,'cat':['Unknown']})], axis = 0)


category.head() # Tabla lista

   id        cat
0   1     Action
1   2  Animation
2   3   Children
3   4   Classics
4   5     Comedy

# Tabla updates

In [55]:
# Vamos a añadir filas en updates para las tablas nuevas o las tablas que no han sido actualizadas en general:

updates = pd.concat([updates, pd.DataFrame({'table': 'staff','last_update':[pd.Timestamp.now()]})], axis = 0)
updates = pd.concat([updates, pd.DataFrame({'table': 'customers','last_update':[pd.Timestamp.now()]})], axis = 0)
updates = pd.concat([updates, pd.DataFrame({'table': 'actorfilm','last_update':[pd.Timestamp.now()]})], axis = 0)


# Y pasaremos el formato de las entradas a datetime:

updates.last_update = pd.to_datetime(updates.last_update)

updates.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9 entries, 0 to 0
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   table        9 non-null      object
 1   last_update  9 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 216.0+ bytes

In [56]:
# Y reiniciamos el índice:

updates.reset_index(inplace = True, drop = True)

updates # Hecho!

       table                last_update
0      actor 2006-02-15 04:34:33.000000
1       film 2006-02-15 05:03:42.000000
2   language 2006-02-15 05:02:19.000000
3     rental 2006-02-15 21:30:53.000000
4  inventory 2006-02-15 05:09:17.000000
5   category 2006-02-15 04:46:27.000000
6      staff 2023-07-31 02:46:16.822367
7  customers 2023-07-31 02:46:16.823556
8  actorfilm 2023-07-31 02:46:16.824501

Como último retoque, estaría bien que el género de la película (category_id) no estuviera en actorfilm, sino en la propia tabla de películas. Vamos a hacer un traslado de una a otra a través de un diccionario como antes.

In [57]:
cat_dict = dict(zip(actorfilm.film_id,actorfilm.category_id))

cat_dict

{1: 6,
 23: 2,
 25: 13,
 106: 10,
 140: 14,
 166: 4,
 277: 11,
 361: 15,
 438: 10,
 499: 8,
 506: 11,
 509: 3,
 605: 9,
 635: 13,
 749: 11,
 832: 8,
 939: 5,
 970: 4,
 980: 12,
 3: 6,
 31: 8,
 47: 9,
 105: 1,
 132: 14,
 145: 8,
 226: 13,
 249: 4,
 314: 2,
 321: 13,
 357: 4,
 369: 14,
 399: 9,
 458: 8,
 481: 13,
 485: 3,
 518: 16,
 540: 12,
 550: 8,
 555: 5,
 561: 13,
 742: 10,
 754: 5,
 811: 16,
 958: 7,
 17: 12,
 40: 6,
 42: 15,
 87: 16,
 111: 1,
 185: 9,
 289: 13,
 329: 1,
 336: 6,
 341: 4,
 393: 6,
 441: 6,
 453: 15,
 480: 4,
 539: 7,
 618: 7,
 685: 13,
 827: 7,
 966: 6,
 967: 14,
 971: 9,
 996: 6,
 56: 1,
 62: 6,
 79: 7,
 355: 2,
 379: 7,
 398: 12,
 463: 15,
 490: 13,
 616: 6,
 691: 15,
 712: 6,
 714: 14,
 721: 12,
 798: 14,
 858: 5,
 909: 11,
 924: 14,
 19: 1,
 54: 12,
 85: 6,
 146: 7,
 171: 11,
 172: 7,
 202: 5,
 203: 14,
 286: 16,
 288: 16,
 316: 10,
 340: 13,
 375: 1,
 383: 15,
 392: 3,
 411: 12,
 503: 15,
 535: 11,
 571: 6,
 650: 6,
 665: 11,
 687: 6,
 730: 13,
 732: 1,
 817: 14,
 841: 15,
 865: 2,
 29: 1,
 53: 8,
 60: 4,
 70: 2,
 112: 9,
 164: 6,
 165: 14,
 193: 2,
 256: 15,
 451: 16,
 517: 15,
 519: 15,
 692: 2,
 826: 16,
 892: 2,
 902: 15,
 994: 13,
 27: 15,
 35: 11,
 67: 1,
 96: 13,
 170: 9,
 173: 7,
 217: 10,
 218: 7,
 225: 7,
 292: 1,
 351: 11,
 414: 9,
 554: 4,
 633: 4,
 637: 14,
 758: 7,
 766: 7,
 770: 9,
 805: 2,
 806: 13,
 846: 13,
 900: 9,
 901: 2,
 910: 7,
 957: 9,
 959: 3,
 115: 1,
 158: 12,
 179: 7,
 195: 14,
 205: 1,
 255: 12,
 263: 15,
 396: 7,
 523: 4,
 532: 15,
 752: 12,
 769: 9,
 771: 7,
 859: 2,
 895: 4,
 936: 12,
 30: 11,
 74: 12,
 147: 8,
 148: 9,
 191: 3,
 200: 10,
 204: 7,
 434: 16,
 510: 2,
 514: 7,
 552: 6,
 671: 15,
 697: 1,
 722: 11,
 815: 4,
 873: 3,
 889: 3,
 903: 16,
 926: 6,
 964: 1,
 974: 13,
 9: 11,
 236: 10,
 251: 13,
 366: 7,
 477: 12,
 522: 5,
 530: 1,
 587: 6,
 694: 4,
 703: 2,
 716: 11,
 782: 15,
 914: 16,
 929: 9,
 930: 14,
 983: 12,
 118: 2,
 281: 10,
 283: 13,
 348: 8,
 364: 13,
 395: 1,
 429: 15,
 433: 2,
 567: 9,
 597: 10,
 636: 12,
 709: 7,
 850: 1,
 854: 11,
 888: 6,
 896: 3,
 928: 3,
 938: 5,
 969: 7,
 988: 16,
 16: 9,
 34: 11,
 37: 4,
 91: 4,
 92: 11,
 107: 7,
 155: 13,
 177: 14,
 208: 2,
 213: 8,
 216: 13,
 243: 2,
 344: 3,
 400: 6,
 416: 9,
 420: 15,
 457: 6,
 513: 16,
 593: 11,
 631: 15,
 672: 5,
 728: 7,
 812: 6,
 838: 1,
 871: 5,
 880: 2,
 945: 6,
 45: 13,
 110: 3,
 144: 13,
 154: 2,
 162: 1,
 254: 15,
 337: 9,
 346: 4,
 381: 10,
 385: 5,
 427: 6,
 456: 2,
 515: 3,
 524: 5,
 528: 8,
 588: 3,
 600: 11,
 718: 12,
 729: 15,
 816: 2,
 833: 3,
 843: 4,
 897: 7,
 998: 11,
 187: 15,
 232: 10,
 241: 2,
 253: 1,
 258: 11,
 284: 12,
 370: 3,
 415: 11,
 417: 1,
 418: 7,
 454: 12,
 472: 16,
 475: 11,
 495: 11,
 536: 4,
 537: 4,
 612: 15,
 688: 3,
 759: 13,
 764: 15,
 847: 13,
 856: 11,
 890: 15,
 908: 9,
 919: 10,
 948: 13,
 89: 2,
 108: 13,
 125: 16,
 275: 11,
 280: 3,
 326: 2,
 342: 16,
 445: 4,
 500: 9,
 502: 5,
 541: 2,
 553: 3,
 594: 1,
 626: 3,
 745: 15,
 783: 16,
 795: 8,
 886: 2,
 949: 10,
 968: 1,
 985: 14,
 80: 8,
 101: 6,
 121: 2,
 221: 6,
 267: 13,
 269: 8,
 271: 1,
 287: 1,
 345: 8,
 455: 9,
 548: 4,
 582: 2,
 583: 2,
 717: 1,
 779: 15,
 119: 5,
 124: 3,
 127: 5,
 199: 6,
 201: 9,
 310: 10,
 313: 11,
 378: 12,
 469: 4,
 478: 5,
 521: 7,
 573: 3,
 603: 8,
 606: 15,
 734: 6,
 794: 1,
 800: 11,
 853: 3,
 874: 4,
 44: 14,
 84: 16,
 268: 2,
 279: 15,
 386: 16,
 460: 9,
 462: 12,
 484: 4,
 808: 4,
 842: 10,
 863: 14,
 883: 3,
 917: 15,
 944: 7,
 2: 11,
 152: 3,
 182: 5,
 212: 1,
 266: 4,
 404: 5,
 428: 8,
 473: 7,
 644: 2,
 670: 6,
 673: 12,
 711: 14,
 750: 13,
 756: 5,
 785: 16,
 877: 12,
 63: 8,
 231: 8,
 274: 6,
 492: 13,
 527: 11,
 531: 9,
 538: 13,
 589: 6,
 643: 7,
 652: 4,
 663: 4,
 757: 6,
 784: 16,
 962: 4,
 977: 16,
 6: 9,
 88: 16,
 142: 6,
 159: 5,
 426: 12,
 497: 6,
 507: 10,
 680: 5,
 686: 13,
 700: 8,
 702: 11,
 733: 15,
 804: 11,
 887: 2,
 893: 14,
 920: 13,
 291: 15,
 294: 16,
 349: 2,
 430: 2,
 483: 10,
 491: 3,
 634: 8,
 648: 16,
 731: 4,
 775: 7,
 802: 1,
 912: 14,
 78: 2,
 116: 4,
 117: 10,
 235: 14,
 367: 14,
 419: 8,
 435: 9,
 449: 14,
 549: 1,
 649: 2,
 820: 2,
 855: 6,
 935: 13,
 981: 16,
 997: 12,
 83: 8,
 126: 1,
 178: 5,
 194: 1,
 242: 5,
 335: 5,
 405: 16,
 585: 7,
 653: 11,
 704: 5,
 781: 10,
 829: 8,
 21: 1,
 86: 12,
 153: 14,
 245: 2,
 311: 9,
 564: 2,
 755: 3,
 90: 13,
 93: 13,
 103: 16,
 186: 7,
 327: 1,
 390: 14,
 529: 5,
 544: 6,
 682: 8,
 715: 8,
 821: 9,
 885: 11,
 904: 11,
 906: 5,
 150: 6,
 273: 8,
 334: 11,
 347: 16,
 359: 8,
 586: 1,
 679: 8,
 695: 8,
 830: 11,
 986: 2,
 14: 4,
 43: 8,
 58: 6,
 259: 2,
 358: 4,
 508: 10,
 551: 13,
 574: 1,
 619: 15,
 625: 14,
 743: 2,
 790: 7,
 793: 1,
 835: 10,
 879: 12,
 953: 2,
 973: 6,
 10: 15,
 131: 4,
 133: 12,
 282: 7,
 296: 14,
 436: 13,
 444: 5,
 482: 4,
 488: 15,
 547: 3,
 590: 13,
 646: 10,
 723: 14,
 862: 4,
 64: 7,
 69: 14,
 77: 13,
 260: 15,
 262: 8,
 301: 11,
 318: 1,
 565: 9,
 797: 12,
 163: 13,
 188: 5,
 299: 16,
 308: 5,
 368: 7,
 380: 9,
 431: 9,
 739: 7,
 978: 5,
 65: 11,
 136: 13,
 197: 15,
 219: 6,
 309: 8,
 312: 14,
 401: 7,
 651: 2,
 667: 15,
 669: 9,
 135: 15,
 214: 3,
 252: 1,
 305: 13,
 306: 10,
 489: 2,
 735: 3,
 737: 11,
 878: 16,
 881: 11,
 965: 11,
 972: 14,
 993: 3,
 244: 12,
 389: 15,
 493: 9,
 525: 4,
 668: 15,
 720: 13,
 788: 6,
 836: 15,
 950: 4,
 52: 9,
 615: 2,
 707: 1,
 738: 9,
 748: 1,
 15: 9,
 81: 14,
 387: 10,
 410: 5,
 466: 6,
 569: 2,
 875: 15,
 915: 1,
 931: 16,
 956: 10,
 12: 12,
 122: 11,
 317: 5,
 467: 9,
 572: 14,
 662: 7,
 839: 14,
 840: 10,
 925: 6,
 963: 2,
 989: 16,
 24: 11,
 160: 2,
 176: 15,
 223: 2,
 338: 14,
 353: 9,
 448: 13,
 450: 3,
 501: 1,
 516: 12,
 705: 9,
 876: 11,
 71: 8,
 73: 14,
 168: 3,
 222: 11,
 290: 9,
 293: 15}

In [58]:
# Ahora nos vamos a la tabla de film y construimos la nueva columna.

# Esta función nos ayudará a establecer un valor de 17 para aquellas películas del registro que
# no pertenezcan a una categoría concreta ('Unknown'):

def exchange(i): 
    try: return cat_dict[i]
    except: return 17

film['category_id'] = [exchange(i) for i in film.film_id]

film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,deleted_scenes,behind_scenes,trailer,commentaries,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,7,6,0.99,86,20.99,PG,1,1,0,0,6
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,7,3,4.99,48,12.99,G,1,0,1,0,11
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,7,2.99,50,18.99,NC-17,1,0,1,0,6
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,7,5,2.99,117,26.99,G,0,1,0,1,17
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,7,6,2.99,130,22.99,G,1,0,0,0,17

In [59]:
# Eliminamos la columna de category_id de actorfilm y listo:

actorfilm.drop(columns = 'category_id', inplace = True)

actorfilm.head() # Hecho

   film_id  actor_id
0        1         1
1       23         1
2       25         1
3      106         1
4      140         1

# Guardado de datos

Ahora que los datos están limpios, los guardamos en nuevos csv. En el siguiente notebook acabaremos de organizarlos ya teniendo más en mente el ERD final de la base de datos que crearemos en SQL.

In [60]:
# Guardamos los datos de todas las tablas

actor.to_csv('../data/actor_clean.csv', index = False)
category.to_csv('../data/category_clean.csv', index = False)
film.to_csv('../data/film_clean.csv', index = False)
language.to_csv('../data/language_clean.csv', index = False) 
actorfilm.to_csv('../data/actorfilm_clean.csv', index = False)
inventory.to_csv('../data/inventory_clean.csv', index = False)
updates.to_csv('../data/updates_clean.csv', index = False)
staff.to_csv('../data/staff_clean.csv', index = False)
customers.to_csv('../data/customers_clean.csv', index = False)
rental.to_csv('../data/rental_clean.csv', index = False)